pavlenko/pio-lib-STM32/inc/stm32/dev/common/_cmsis.hpp
#pragma once

extern "C" {
#if defined(STM32F0)
#include <stm32f0xx.h>
#elif defined(STM32F1)
#include <stm32f1xx.h>
#elif defined(STM32F2)
#include <stm32f2xx.h>
#elif defined(STM32F3)
#include <stm32f3xx.h>
#elif defined(STM32F4)
#include <stm32f4xx.h>
#elif defined(STM32F7)
#include <stm32f7xx.h>
#elif defined(STM32G0)
#include <stm32g0xx.h>
#elif defined(STM32G4)
#include <stm32g4xx.h>
#elif defined(STM32H7)
#include <stm32h7xx.h>
#elif defined(STM32L0)
#include <stm32l0xx.h>
#elif defined(STM32L1)
#include <stm32l1xx.h>
#elif defined(STM32L4)
#include <stm32l4xx.h>
#elif defined(STM32L5)
#include <stm32l5xx.h>
#elif defined(STM32MP1)
#include <stm32mp1xx.h>
#elif defined(STM32U5)
#include <stm32u5xx.h>
#elif defined(STM32WB)
#include <stm32wbxx.h>
#elif defined(STM32WL)
#include <stm32wlxx.h>
#else
#error "STM32YYxx chip series is not defined"
#endif
}

#define CLR_BIT CLEAR_BIT

namespace STM32
{
    enum class Status : uint8_t {
        OK,
        ERROR,
        BUSY,
        TIMEOUT,
    };

    template <typename T>
    class Singleton
    {
    public:
        Singleton(const Singleton<T>&) = delete;
        const Singleton<T>& operator = (const Singleton<T>&) = delete;

        static constexpr T& instance() { return _instance; }

    protected:
        Singleton() = default;

    private:
        inline static constinit T _instance;
    };

    template <typename T>
    class A;

    template <typename T, typename TT>
    class B : public A<T>
    {
    public:
        void funcB1() { B::funcA1(); } //<-- solution for no-static functions
        static void funcB2() { B::funcA2(); } //<-- solution for static functions
    };

    template <typename T>
    class A
    {
    public:
        void funcA1() {}
        static void funcA2() {}
    };
}
